# Read, Write File

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data=[[2,3],["Hello","World"],[34, True]], index=['R1','R2','R3'])

# .csv

In [3]:
df.to_csv('SampleCsv.csv')

In [6]:
df1 = pd.read_csv('SampleCsv.csv', index_col=0)

In [7]:
df1

        0      1
R1      2      3
R2  Hello  World
R3     34   True

# .html

In [ ]:
# https://en.wikipedia.org/wiki/The_World%27s_Billionaires_2015

In [10]:
list_of_tables = pd.read_html('https://en.wikipedia.org/wiki/The_World%27s_Billionaires_2015')

In [11]:
type(list_of_tables)

list

In [14]:
len(list_of_tables)

4

In [15]:
list_of_tables[1]

,0,1,2,3,4,5
0,No.,name,Net worth (USD),Age,Citizenship,Source(s) of wealth
1,7000100000000000000♠1,"Gates, BillBill Gates",$79.2 billion,60,United States,Microsoft
2,7000200000000000000♠2,"Slim, CarlosCarlos Slim",$77.1 billion,75,Mexico,Telmex
3,7000300000000000000♠3,"Buffett, WarrenWarren Buffett",$72.7 billion,84,United States,Berkshire Hathaway
4,7000400000000000000♠4,"Ortega, AmancioAmancio Ortega",$64.5 billion,78,Spain,Inditex Group
5,7000500000000000000♠5,"Ellison, LarryLarry Ellison",$54.3 billion,70,United States,Oracle Corporation
6,7000600000000000000♠6,"Koch, CharlesCharles Koch",$42.9 billion,79,United States,Koch Industries
7,7000600000000000000♠6,"Koch, DavidDavid Koch",$42.9 billion,74,United States,Koch Industries
8,7000800000000000000♠8,"Walton, ChristyChristy Walton",$41.7 billion,60,United States,Wal-Mart
9,7000900000000000000♠9,"Walton, JimJim Walton",$40.6 billion,66,United States,Wal-Mart
10,7001100000000000000♠10,"Bettencourt, LilianeLiliane Bettencourt",$40.1 billion,92,France,L'Oreal

# .excel

In [17]:
df

        0      1
R1      2      3
R2  Hello  World
R3     34   True

In [18]:
df.to_excel('SampleExcel.xls')